Revit 2027 API
BuiltInFailures.RoomFailures.RoomsInSameRegionSpaces Property
 Multiple [Room] are in the same enclosed region. The correct area and perimeter will be assigned to one [Room] and the others will display "Redundant [Room]." You should separate the regions, delete the extra [Room], or move them into different regions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomsInSameRegionSpaces { get; }
Public Shared ReadOnly Property RoomsInSameRegionSpaces As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomsInSameRegionSpaces {
	FailureDefinitionId^ get ();
}
static member RoomsInSameRegionSpaces : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace